# Connect to MySQL Server

After [installing SQL magic for Jupyter](Install-SQL-Magic.ipynb), you are ready to use SQL directly from a Jupyter notebook.

Make sure you know the database host name, the username, and the password.

To avoid exposing your credentials, let's store them in a file name `cred.json` in the current directly: 
* Go to the Jupyter `Home` tab
* From the "New" dropdown menu, select `Text File`.
* Rename the file to `cred.json`
* In the editor, type the following:

```
{
    "host": "database-host-address",
    "user": "your-user-name",
    "password": "your-secret-password"
}

```
* You can close the tab

Make sure no one else sees this file. Do not send it to anyone and do not check it in with your homework.

Now you can create your connection string in python:

In [1]:
import json
with open('cred.json') as f:
    creds = json.load(f)

In [2]:
connection_string = "mysql://{user}:{password}@{host}".format(**creds)

Now import the mysql client library and make it available to the SQL magic:

In [20]:
import pymysql 
pymysql.install_as_MySQLdb()

Now enable the SQL magic:

In [21]:
%load_ext sql
%config SqlMagic.autocommit=True

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

and connect to the server:

In [22]:
%sql $connection_string

You are done! You can now write and execute SQL queries in cells that start with `%%sql`:

In [10]:
%%sql

CREATE SCHEMA dimitri_university

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1007, "Can't create database 'dimitri_university'; database exists")
[SQL: CREATE SCHEMA dimitri_university]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [13]:
%%sql

CREATE TABLE dimitri_university.person (
    person_id  int unsigned NOT NULL,
    first_name varchar(30) NOT NULL,
    last_name varchar(30) NOT NULL,
    PRIMARY KEY(person_id)
)

 * mysql://dimitri:***@db.ust-data-sci.net
0 rows affected.

[]

In [12]:
%%sql

DROP TABLE dimitri_university.person;

 * mysql://dimitri:***@db.ust-data-sci.net
0 rows affected.

[]

In [14]:
%%sql

INSERT INTO dimitri_university.person VALUES (1, "Alice", "Cooper");

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[]

In [15]:
%%sql

SELECT * FROM dimitri_university.person;

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[(1, 'Alice', 'Cooper')]

In [ ]:
%%sql

DROP TABLE dimitri_university.person;

In [16]:
%%sql

SHOW SCHEMAS

 * mysql://dimitri:***@db.ust-data-sci.net
2 rows affected.

[('dimitri_university',), ('information_schema',)]

In [17]:
%%sql

SHOW TABLES IN dimitri_university;

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[('person',)]

In [18]:
%%sql

SHOW CREATE TABLE dimitri_university.person;

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[('person', 'CREATE TABLE `person` (\n  `person_id` int(10) unsigned NOT NULL,\n  `first_name` varchar(30) NOT NULL,\n  `last_name` varchar(30) NOT NULL,\n  PRIMARY KEY (`person_id`)\n) ENGINE=InnoDB DEFAULT CHARSET=latin1')]